<template>
  <div class="">
    <swiper :options="swiperOptions" class="swiper">
      <swiper-slide class="text" >
        <div>央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。央视网消息：目前，叙利亚反政府武装占据的最后一块主要地盘——伊德利卜省已陷入了叙利亚政府军的重围，随着7号伊朗、俄罗斯和土耳其三国峰会举行、而土耳其“在伊德利卜宣布停火”的建议没能被写入联合声明中，两天来，叙利亚政府军和俄罗斯空天部队加紧了对伊德利卜省部分地区的空袭，“伊德利卜收复战”或许即将正式打响。

       据总部设在伦敦的所谓“叙利亚人权观察组织”消息，8号，叙利亚政府军和俄罗斯空天部队的战机加大空袭力度，对伊德利卜省和中部哈马省的多个反政府武装目标实施密集轰炸。</div>
      </swiper-slide>
      <!-- <div class="slide-pagination" slot="pagination"></div> -->
    </swiper>
  </div>
</template>

<script>
import 'swiper/dist/css/swiper.css'
import { swiper, swiperSlide } from 'vue-awesome-swiper'
export default {
  components: {
    swiper, swiperSlide
  },
  data() {
    return {
      slides: [1, 2, 4, 5, 6],
      swiperOptions: {
        direction: 'vertical',
        slidesPerView: 1,
        freeMode: true, // 自由模式，false 表示每次一格且贴合
        mousewheel: true
      }
      /*
      swiperOption: {
          direction: 'vertical',
          slidesPerView: 1,
          mousewheel: true,
          height: window.innerHeight   // 高度设置，占满设备高度
      } */
    }
  }
}
</script>

<style lang="less" scoped>
.swiper {
  height: 200px;
  overflow: hidden;
  background-color: green;
  .text {
    font-size: 12px;
    text-align: center;
    padding: 20px;
    height: auto;
  }
}
</style>
